# meta package that includes kuser for a user & group management gui which is missing from Mint
kdeadmin

# Login Manager that supports setting which users are displayed in the list
kdm
kdm-theme-mint-kde

# KDiskFree graphical display of space used on mounted partitions
kdf

# manage running processes from the commandline
htop

# find what's talking up diskspace from the commandline
ncdu

# virtual terminal that can be attached and detached, good for starting things like a minecraft server via ssh
screen

# Support making gnome packages match kde visual settings
kde-config-gtk-style
qtcurve

# A gui partition editor which supports gpt partitions
gparted

# VIM text editor
vim-gtk
exuberant-ctags
fonts-inconsolata

# markdown editing support
retext
# recommended for retext
python3-markdown
python3-enchant
python3-markups
docutils-common

# IRC client
quassel

# Diagramming and vector graphics application (like Visio)
dia

# Version Control Systems that are good to have available
git
git-svn
mercurial

# needed for Brix development
chromium-browser
# see notes for adding repo for nodejs (latest nodejs is back in std repos so no need)
nodejs

# for building the Brix Nemo plugin
default-jdk
#mongodb

# tomcat is needed if we want to run an AMS locally
# but there are now enough other parts needed that we
# don't do this.
#tomcat7-user
#tomcat7-docs
#tomcat7-admin

# for building git (see INSTALL file in Projects/public/git)
libcurl4-gnutls-dev
libexpat1-dev
# when I tried to get libz-dev it apt-get gave me a note about getting zlib1g-dev instead
libz-dev
libssl-dev
gettext
asciidoc
xmlto
docbook2x

# for building keepassx v2
build-essential
cmake
qt4-dev-tools
libqt4-dev
libgcrypt11-dev
zlib1g-dev
libxtst-dev

# recommended by something above
python3-docutils
python3-pygments

