# meta package that includes kuser for a user & group management gui which is missing from Mint
#kdeadmin is no longer available
#kdeadmin
kuser

# Login Manager that supports setting which users are displayed in the list
# sadly kdm is no longer maintained or available
#kdm
#kdm-theme-mint-kde

# KDiskFree graphical display of space used on mounted partitions
kdf

# manage running processes from the commandline
htop
atop

# find what's talking up diskspace from the commandline
ncdu

# virtual terminal that can be attached and detached, good for starting things like a minecraft server via ssh
#screen
tmux

# commandline tool to calculate a 2FA (2-factor authentication) code if you know the secret key
# found from https://thirld.com/blog/2016/01/16/generating-two-factor-authentication-codes-on-linux/
# oathtool --base32 --totp "<SECRET>" 
oathtool

# Support making gnome packages match kde visual settings
kde-config-gtk-style
qtcurve

# A gui partition editor which supports gpt partitions
gparted

# VIM text editor
vim-gtk3
# utility needed by vim-taglist plugin
exuberant-ctags
# fixed width fonts for text editing
fonts-inconsolata

# markdown editing support
retext
# recommended for retext
python3-markdown
python3-enchant
python3-markups
docutils-common

# IRC client
quassel

# Instant messaging
pidgin
pidgin-data
pidgin-extprefs
pidgin-plugin-pack

# Diagramming and vector graphics application (like Visio)
dia

# Game pack
# kdegames package no longer exists, but it was composed of the following
# (http://askubuntu.com/questions/614491/is-there-a-kdegames-package-alternative-in-15-04):

# arcade spaceship game
bomber
# gomoku (five in line) board game
bovo
# Bomberman clone
granatier
# Pac-Man clone
kapman
# atomix puzzle game
katomic
# Black Box puzzle game
kblackbox
# falling blocks game
kblocks
# Jezzball arcade game
kbounce
# ball and paddle game
kbreakout
# three-in-a-row game
kdiamond
# Connect Four game
kfourinline
# Lode Runner arcade game
kgoldrunner
# go game
kigo
# port of the classic BSD console game robots
killbots
# Yahtzee dice game
kiriki
# simple tactical game
kjumpingcube
# SameGame puzzle game
klickety
# color lines game
klines
# mahjongg solitaire game
kmahjongg
# minesweeper game
kmines
# battleship board game
knavalbattle
# wire puzzle game
knetwalk
# miniature golf game
kolf
# simple ball dodging game
kollision
# simple turn-based strategy game
konquest
# solitaire card games
kpat
# reversi board game
kreversi
# Shisen-Sho solitaire game
kshisen
# Risk strategy game
ksirk
# Tron-like snakerace game
ksnakeduel
# SpaceWar! arcade game
kspaceduel
# Dots and Boxes game
ksquares
# Sudoku puzzle game and solver
ksudoku
# stamp drawing toy
ktuberling
# game based on Rubik's Cube
kubrick
# Lieutnant Skat card game
lskat
# jigsaw puzzle game
palapeli
# Number logic game
picmi
# classical Mah Jongg game
kajongg





# KDE4 Plasma widgets (playwolf is for amarok)
plasma-widgets-addons
#plasma-widget-playwolf

# Windows emulator
#wine
#q4wine
#winetricks
#playonlinux
#wine-mono0.0.8
#wine-gecko2.21
#fonts-liberation

# Geneology application
gramps

# Convert audio files (ie flac -> ogg) There's also a SoundConverter which is gnome based
soundkonverter

# documentation of various packages
#samba-doc
#python-doc
#python-qt4-doc

# utilities for mounting and unmounting cifs network file systems
cifs-utils
# utility to mount samba share when you browse to it in dolphin to make it more accessible
#smb4k

# nfs
nfs-kernel-server

# ssh client and server (be sure to make changes to /etc/ssh/sshd_config to enhance security
# see http://www.linuxjournal.com/content/more-secure-ssh-connections?page=0,0)
ssh

# utility needed to be able to create a System Rescue disk on a flash drive
syslinux

# utility needed to make a bootable flash drive from a linux distro ISO
# unetbootin (download the linux installer instead to get very latest)
# utility needed by unetbootin installer
p7zip-full

# utility to help locate package to install when builds encounter missing files
#apt-file

# utility to build a package for an app compiled from source so it can be uninstalled
#checkinstall

# diff/merge tool for use w/ source control (may also want Beyond Compare)
#kdiff3

# Version Control Systems that are good to have available
git
git-svn
mercurial

# needed for Brix development
chromium-browser
# see notes for adding repo for nodejs (latest nodejs is back in std repos so no need)

#nodejs

# for building the Brix Nemo plugin
#default-jdk
#mongodb

# tomcat is needed if we want to run an AMS locally
# but there are now enough other parts needed that we
# don't do this.
#tomcat7-user
#tomcat7-docs
#tomcat7-admin

# for building git (see INSTALL file in Projects/public/git)
libcurl4-gnutls-dev
libexpat1-dev
# when I tried to get libz-dev it apt-get gave me a note about getting zlib1g-dev instead
libz-dev
libssl-dev
gettext
asciidoc
xmlto
docbook2x

# for building keepassx v2
build-essential
cmake
# kde5 needs qt5
#qt4-dev-tools
#libqt4-dev
qtbase5-dev
libgcrypt11-dev
zlib1g-dev
libxtst-dev

# recommended by something above
python3-docutils
python3-pygments

